projects/app/Http/Controllers/PageController.php

    public function dynamicDataCategory(Request $request, $seo_url = null)
    {

        if ($seo_url == "home") {
            return redirect("/");
            //  return redirect()->route('front-home');
        }



        $data = Cms::where("seo_url", $seo_url)->first();
        if ($seo_url == "user-login") {
            //     pre(Auth::guard('employee')->user());


            if (!\Illuminate\Support\Facades\Auth::guard('employee')->check()) {
                // return redirect('/user-login');
                $templete = "front.static.login";
                return view($templete, compact("data"));
            }
        }


         if (isset($request->roll_no)) {
            // return $request;
            $data = Cms::where("seo_url", "result")->first();
            $user = Customer::where("roll_no", $request->roll_no)
                ->where("name", $request->name)
                ->where("father_name", $request->father_name)
                ->first();

            if ($user) {
                $resultData = Result::where("user_id", $user->id)->get();
---
select * from `customers` where `roll_no` is null and `name` is null and `father_name` is null limit 1
select * from `results` where `user_id` = 11

            return view($templete, compact("data"));
        }

        $data = Location::where("seo_url", $seo_url)->first();
---
select * from `locations` where `seo_url` is null limit 1