projects/app/Helper/ModelHelper.php

select * from `subjects`
---
    function getSubjectSelectList(){
        $data=[];
        $all=Subject::all();

select * from `basic_settings` where `name` = 'favicon' limit 1
---
	public function getDataFromSetting($name){
		$result=null;
		$data=BasicSetting::where("name",$name)->first();