projects/app/Http/Controllers/Employee/Auth/LoginRegisterController.php

select * from `customers` where `roll_no` = '123456' limit 1
---
    protected function attemptLogin(Request $request)
    {

        $user = \App\Models\Customer::where('roll_no', $request->roll_no)->first();

select * from `customers` where `roll_no` = '123456' limit 1
---
    protected function getCustomer(Request $request)
    {
        // return Customer::where('email',$request->email)->first();
        return Customer::where('roll_no', $request->roll_no)->first();