projects/app/Http/Controllers/Admin/DashboardController.php

select * from `customers` where `customers`.`id` = '8' limit 1
update `customers` set `publish` = 'published', `customers`.`updated_at` = '2025-05-17 18:16:01' where `id` = 8
---
    function setPublishData($model,$id,$status){
        if($model=="locations"){
            $data=Location::find($id);
            if($data){
                $data->publish=$status;
                $data->save();
            }
        }
        if($model=="stores"){
            $data=Store::find($id);
            if($data){
                $data->publish=$status;
                $data->save();
            }
        }
        if($model=="customers"){
            $data=Customer::find($id);
            if($data){
                $data->publish=$status;
                $data->save();